In [ ]:
import pandas as pd

In [ ]:
df=pd.read_csv('/content/sample_data/Salaries.csv')

In [ ]:
df.head()

   Id       EmployeeName  ...         Agency  Status
0   1     NATHANIEL FORD  ...  San Francisco     NaN
1   2       GARY JIMENEZ  ...  San Francisco     NaN
2   3     ALBERT PARDINI  ...  San Francisco     NaN
3   4  CHRISTOPHER CHONG  ...  San Francisco     NaN
4   5    PATRICK GARDNER  ...  San Francisco     NaN

[5 rows x 13 columns]

Use the info() method to find out how many

what is the average basepay

In [ ]:
df['BasePay'].mean()

66325.44884050643

what is the highest amount of overtimePay in the data set?

In [ ]:
df['OvertimePay'].max()

245131.88

what is the job title of JOSEPH DRISCOLL?

In [ ]:
df[df['EmployeeName']=='JOSEPH DRISCOLL']['JobTitle']

24    CAPTAIN, FIRE SUPPRESSION
Name: JobTitle, dtype: object

How much does JOSEPH DRISCOLL MAKE?

In [ ]:
df[df['EmployeeName']=='JOSEPH DRISCOLL']['TotalPayBenefits']

24    270324.91
Name: TotalPayBenefits, dtype: float64

What is the name of the highest paid person

In [ ]:
df[df['TotalPayBenefits']==df['TotalPayBenefits'].max()]

   Id    EmployeeName  ...         Agency  Status
0   1  NATHANIEL FORD  ...  San Francisco     NaN

[1 rows x 13 columns]

what is the name of lowest paid person ?

In [ ]:
df[df['TotalPayBenefits']==df['TotalPayBenefits'].min()]

            Id EmployeeName  ...         Agency  Status
148653  148654    Joe Lopez  ...  San Francisco     NaN

[1 rows x 13 columns]

what was the average(mean) BasePay of all employees per year?(2011-2014)?

In [ ]:
df.groupby('Year').mean()['BasePay']

Year
2011    63595.956517
2012    65436.406857
2013    69630.030216
2014    66564.421924
Name: BasePay, dtype: float64

How many unique job titles are there

In [ ]:
df['JobTitle'].nunique()

2159

What are the top 5 most common jobs ?

In [ ]:
df['JobTitle'].value_counts()[:5]

Transit Operator                7036
Special Nurse                   4389
Registered Nurse                3736
Public Svc Aide-Public Works    2518
Police Officer 3                2421
Name: JobTitle, dtype: int64

How many job titles were represented by only one person in 2013 ?

In [ ]:
df[df['Year']==2013]['JobTitle'].value_counts()==1

Transit Operator                False
Special Nurse                   False
Registered Nurse                False
Public Svc Aide-Public Works    False
Custodian                       False
                                ...
Media Training Specialist        True
Environmental Hlth Tech 2        True
Asst Director, Juvenile Hall     True
Painter Supervisor 2             True
Industrial Engineer              True
Name: JobTitle, Length: 1051, dtype: bool

In [ ]:
sum(df[df['Year']==2013]['JobTitle'].value_counts()==1)

202

How many people have the word chief in their job tittle ?

In [ ]:
import pandas as pd